Autodesk.Revit.DB.FamilyInstance.GetDrivingCurveForProfile
Gets the driving curve of the family instance.
Returns:
Returns the driving curve.

Autodesk.Revit.DB.FamilyInstance.GetReferenceName(Autodesk.Revit.DB.Reference)
Gets the name of the reference plane in the family corresponding to the given family instance reference.
Remarks:
If the given family reference corresponds to a named reference plane in the instance's family, the name of that reference plane will be returned.
Otherwise, an empty string will be returned.
reference:
The family instance reference.
Returns the driving curve from the family instance reference.
Returns:
Returns the name of the reference plane in the family corresponding to the given family instance reference.
If the reference doesn't correspond to a named reference plane, returns an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.FamilyInstance.GetMaterialIdForGeometryTag(System.Int32)
Material assigned to a family geometry body identified by geometry tag.
Remarks: Maps instance geometry tags to symbol tags when the instance has own geometry.
geometryTag: Geometry tag from Autodesk::Revit::DB::GeometryObject::Id.
Returns: Material element id, or invalidElementId when unmapped.